In [30]:
list_ = [1, 1, 2, 3, 5]
print(list_)
list_.extend(list_)
print(list_)
list_.count(2)
list_.pop(1)
print(list_)
list_.count(1)

[1, 1, 2, 3, 5]
[1, 1, 2, 3, 5, 1, 1, 2, 3, 5]
[1, 2, 3, 5, 1, 1, 2, 3, 5]

3

In [86]:
listt = [1,2,3,4,5,6,7,8,9,10]
slist = []
for i in range(1,11):
    slist.append(i*i)
print(slist)

[1, 4, 9, 16, 25, 36, 49, 64, 81, 100]

In [74]:
listt = [1,2,3,4,5,6,7,8,9,10]
for i in listt:
    print((i)-(listt[i-2]))

-9
1
1
1
1
1
1
1
1
1

In [72]:
listt = [1,2,3,4,5,6,7,8,9,10]
for i in listt:
    print(i)

1
2
3
4
5
6
7
8
9
10

In [102]:
listt = [1,2,3,4,5,6,7,8,9,10]
del(listt[1])
print(listt)

[1, 3, 4, 5, 6, 7, 8, 9, 10]

In [121]:
sett={2,3,1,5}
sset={'a','b',2,4,'k',3,}
print(sett)
seet=sett.union(sset)
print(seet)

sett.intersection_update(sset)
print(sett)

{1, 2, 3, 5}
{'a', 1, 2, 3, 4, 5, 'k', 'b'}
{2, 3}

In [173]:
disto = {"12":3,
        5:"dis"}
disto[5] = "sid"
dis = disto.copy()
print(disto.values())
strp = "46kdfy556"

print(dis)

dict_values([3, 'sid'])
{'12': 3, 5: 'sid'}

In [213]:
po = [1,'f','g',4,3]


del(po[2])
po[2] = "13"
po.reverse()
po.remove(1)
print(po)

[3, '13', 'f']

In [1]:
i = 0
while i < 6:
  i += 1
  if i == 3:
    continue
  print(i)

1
2
4
5
6

In [4]:
nat = int(input("NATURAL = "))
n = 0
if nat<0:
    print("Nagative")
elif nat==0:
    print("0")
else:
    for i in range(1,nat+1):
        n = i+n
    print(n)

NATURAL = 7
28

In [10]:
h = input("give = ")
print(h.replace("a","&"))

give = raam
r&&m

In [52]:
student = {'city':[1,1,2,',','7'],
          'vise':("chennai","mun",'dfgg'),
          'roll':["poditive",'num','vith']}

((((student)['city'][-1]))) = "5"
print(student)
student['school_name']=["abc","bcd","efg"]

if "mun" in student["vise"]:
    print("yes")
student.values()

{'city': [1, 1, 2, ',', '5'], 'vise': ('chennai', 'mun', 'dfgg'), 'roll': ['poditive', 'num', 'vith']}
yes

dict_values([[1, 1, 2, ',', '5'], ('chennai', 'mun', 'dfgg'), ['poditive', 'num', 'vith'], ['abc', 'bcd', 'efg']])

In [137]:
si = {1,1,1,1,4.,5,'kl'}

sl = set(('as','sa','d','k','i',"dg",5))
si.remove(4)
print(si)
sl.add(90)
si.union(sl)

{1, 5, 'kl'}

{1, 5, 90, 'as', 'd', 'dg', 'i', 'k', 'kl', 'sa'}

In [212]:

dict([(i,j) for i,j in zip(['as','lo','op'],{1,2,3})])

{'as': 1, 'lo': 2, 'op': 3}

In [227]:
[(i*i) for i in range(1,21) if (i%2==0)]

[4, 16, 36, 64, 100, 144, 196, 256, 324, 400]

In [242]:
((j*i) for j in range(2,4) for i in range(1,4) if j%2==0 )

In [247]:
n = int(input('input = '))
if n%2==0:
    print(n)
elif n==0:
    print(0)
else:
    print("odd")

input = 4
4

In [6]:
# S6 number of digits and letters
b = input('input string')
s=0
n=0
if b.isdigit:
  n=n+1
else:
  s=s+1
print(n,s)

input string123ertt
1 0

In [8]:
string=input("Enter string:")
count1=0
count2=0
for i in string:
      if(i.substring()):
            count1=count1+1
      elif (i.isspace()):
            count2=count2+1
print("The number of digits is:")
print(count1)
print("The number of characters is:")
print(count2)

Enter string:sd321
The number of digits is:
3
The number of characters is:
2

In [25]:
# slicing
inp = input()
print(inp[:3])
print(inp[-1:-4:-1])

kargoy
kar
yog

In [33]:
p = 'lj'
len(p)

2

In [37]:
no = int(input('no of words = '))
tupl=()
for i in range(0,no):
    iny = int(input('your word = '))
    tupl=tupl+tuple(iny)    
print(tupl)

no of words = 2
your word = 3

TypeError: 'int' object is not iterable

In [61]:
jij = int(input())
su = 0
for ji in range(2,jij):
    if (jij%ji!=0):
        su=su+1
if jij==1:
    print("prime")
elif jij<0:
    print("Please enter Positive jij")
else:    
    if (su==jij-2):
        print("prime")
    else:
        print("No prime")

6
No prime

In [2]:
l=[]
n=int(input())
for i in range(0,n):
    e=int(input())
    l.append(e)
print(l)

l.remove(l[0])
l.append(int(input()))
l.sort()
print(l)
l.pop()
l.reverse()
print(l)

3
25
3
4
[25, 3, 4]
6
[3, 4, 6]
[4, 3]

In [3]:
l=[]
n=int(input())
for i in range(3):
    l.insert(int(input()),int(input()))
print(l)

l.remove(l[0])
l.append(int(input()))
l.sort()
print(l)
l.pop()
l.reverse()
print(l)

2
0
1
1
5
2
4
[1, 5, 4]
3
[3, 4, 5]
[4, 3]

In [5]:
l=[]
n=int(input())

l.insert((map(int(input())).split(" "),(n)),(map(int(input())).split(" "),(n)))
print(l)

l.remove(l[0])
l.append(map(int(input())).split(" "),(n-1))
l.sort()
print(l)
l.pop()
l.reverse()
print(l)

2
3

TypeError: map() must have at least two arguments.

### 1.Write a Python function to find the Max three numbers in a given list [1,7,90,33,67,56,20,39,10,30]

In [68]:
l=[1,7,90,33,67,56,20,39,10,30]

In [70]:
def maxx(x):
    o=0
    for i in x:
        if i >o:
            o=i
    print(o)
    j=[]
    for t in x:
        if t == o:
            continue
        else:
            j.append(t)
    print(j)
    return(j)
    
k=maxx(l)
d=maxx(k)
s=maxx(d)

90
[1, 7, 33, 67, 56, 20, 39, 10, 30]
67
[1, 7, 33, 56, 20, 39, 10, 30]
56
[1, 7, 33, 20, 39, 10, 30]

### 2.Write a Python function to calculate the factorial of a number (a non-negative integer). The function accepts the number from user as an argument

In [75]:
q=1
n= int(input())
if n==0:
    print("1")
elif n<0:
    print("cant")
else:
    for i in range(1,n+1):
        q=i*q
    print(q)

4
24

In [114]:
l=list(range(10,100))
print(l,"")

[10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99]

In [118]:
d=list(filter(lambda x:((x>70)&(x<80)),l))
d

[71, 72, 73, 74, 75, 76, 77, 78, 79]

In [122]:
o=list(filter(lambda x: x%2!=0,l))
e=list(filter(lambda x : x%2==0,l))

In [123]:
print(o,e)

[11, 13, 15, 17, 19, 21, 23, 25, 27, 29, 31, 33, 35, 37, 39, 41, 43, 45, 47, 49, 51, 53, 55, 57, 59, 61, 63, 65, 67, 69, 71, 73, 75, 77, 79, 81, 83, 85, 87, 89, 91, 93, 95, 97, 99] [10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98]

In [1]:
import numpy as ny
import pandas as ps
import matplotlib.pyplot as mp
import seaborn as sb

In [52]:
df=ps.read_csv(r"C:\Users\ShinChan\Downloads\titanic_dataset_modified.csv")

In [53]:
df.drop("Unnamed: 0",axis=1)

,pclass,survived,name,gender,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,$211.34,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,$151.55,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,$151.55,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,$151.55,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,$151.55,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.5000,1,0,2665,$14.45,NaN,C,NaN,328.0,NaN
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,$14.45,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5000,0,0,2656,$7.23,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.0000,0,0,2670,$7.23,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.0000,0,0,315082,$7.88,NaN,S,NaN,NaN,NaN

In [58]:
df["gender"].replace({"female":"email"},inplace=True)

In [59]:
df.head(3)

,Unnamed: 0,pclass,survived,name,gender,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,0,1,1,"Allen, Miss. Elisabeth Walton",email,29.0000,0,0,24160,$211.34,B5,S,2,NaN,"St Louis, MO"
1,1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,$151.55,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,2,1,0,"Allison, Miss. Helen Loraine",email,2.0000,1,2,113781,$151.55,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [65]:
map({"email":"fmale","male":"Male"},df["gender"])

In [57]:
df.head()

,Unnamed: 0,pclass,survived,name,gender,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,0,1,1,"Allen, Miss. Elisabeth Walton",email,29.0000,0,0,24160,$211.34,B5,S,2,NaN,"St Louis, MO"
1,1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,$151.55,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,2,1,0,"Allison, Miss. Helen Loraine",email,2.0000,1,2,113781,$151.55,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,$151.55,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",email,25.0000,1,2,113781,$151.55,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [69]:

df.to_html(r"C:\Users\ShinChan\Downloads\titanic_dataset_modified.html")

In [70]:
filter(df["age"]<28,df["age"])

In [72]:
df[df["age"]>28]

,Unnamed: 0,pclass,survived,name,gender,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,0,1,1,"Allen, Miss. Elisabeth Walton",email,29.0,0,0,24160,$211.34,B5,S,2,NaN,"St Louis, MO"
3,3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0,1,2,113781,$151.55,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
5,5,1,1,"Anderson, Mr. Harry",male,48.0,0,0,19952,$26.55,E12,S,3,NaN,"New York, NY"
6,6,1,1,"Andrews, Miss. Kornelia Theodosia",email,63.0,1,0,13502,$77.96,D7,S,10,NaN,"Hudson, NY"
7,7,1,0,"Andrews, Mr. Thomas Jr",male,39.0,0,0,112050,$0.00,A36,S,NaN,NaN,"Belfast, NI"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1290,1290,3,1,"Wilkes, Mrs. James (Ellen Needs)",email,47.0,1,0,363272,$7.00,NaN,S,NaN,NaN,NaN
1294,1294,3,0,"Williams, Mr. Leslie",male,28.5,0,0,54636,$16.10,NaN,S,NaN,14.0,NaN
1298,1298,3,0,"Wittevrongel, Mr. Camille",male,36.0,0,0,345771,$9.50,NaN,S,NaN,NaN,NaN
1301,1301,3,0,"Youseff, Mr. Gerious",male,45.5,0,0,2628,$7.23,NaN,C,NaN,312.0,NaN
1308,1308,3,0,"Zimmerman, Mr. Leo",male,29.0,0,0,315082,$7.88,NaN,S,NaN,NaN,NaN

In [92]:
len(df["age"].value_counts().unique())

32